Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпецификацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботыИРасценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпецификацииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Группа = Элементы.Добавить(
	//"сабАкт_РеквизитыРаботыРасценки",
	//Тип("ГруппаФормы"),
	//ЭтаФорма);
	
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Поведение  = ПоведениеОбычнойГруппы.Обычное;
	//Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	//Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	//Группа.Заголовок = "Расценки и работы";
	
	ТаблицаРасценки = Элементы.Добавить("РаботыИРасценки", Тип("ТаблицаФормы"), ЭтаФорма);
	ТаблицаРасценки.ПутьКДанным = "Объект.РаботыИРасценки";
	//ТаблицаУслуги.Подвал = Истина;
	//ТаблицаУслуги.УстановитьДействие("ПриОкончанииРедактирования", "ПриОкончанииРедактированияГрафик");
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиНоменклатура", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Номенклатура";
		
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСодержание", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Содержание";
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиКоличество", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Количество";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииРасценки");
	ЭлементТаблицыФормы.Ширина = 10;
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиЦена", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Цена";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииРасценки");
	ЭлементТаблицыФормы.Ширина = 10;
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСумма", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Сумма";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииРасценки1");
	ЭлементТаблицыФормы.Ширина = 12;
		
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСчетЗатрат", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.СчетЗатрат";

	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСтатьяЗатрат", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.СтатьяЗатрат";
	
	Элементы.ИсходныеКомплектующие.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	Элементы.РаботыИРасценки.Заголовок = "Расценки и затраты";
	Элементы.РаботыИРасценки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасценки(Элемент)
	ТекДанные = Элементы.РаботыИРасценки.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасценки1(Элемент)
	ТекДанные = Элементы.РаботыИРасценки.ТекущиеДанные;
	ТекДанные.Цена = ?(ТекДанные.Количество, ТекДанные.Сумма / ТекДанные.Количество, 0);
КонецПроцедуры

&НаСервере
Процедура УУ_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Объект.ИсходныеКомплектующие) ИЛИ ЗначениеЗаполнено(Объект.РаботыИРасценки) Тогда
		ИндексПоляОбъект = ПроверяемыеРеквизиты.Найти("Объект");
		Если ИндексПоляОбъект <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексПоляОбъект);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры
